dot_emacs.d/init.org
#+author: Martin Lönn Andersson
#+title: Emacs Configuration
#+property: header-args:emacs-lisp :lexical t :tangle ./init.el

* Contents :toc@5@gh:
- [[#preamble][Preamble]]
- [[#startup][Startup]]
  - [[#early-init][Early Init]]
    - [[#defer-garbage-collection][Defer Garbage Collection]]
    - [[#disable-package-enable-at-startup][Disable =package-enable-at-startup=]]
    - [[#unset-file-name-handler-alist][Unset =file-name-handler-alist=]]
    - [[#hide-ui-elements][Hide UI Elements]]
    - [[#suppress-warnings-buffer][Suppress Warnings Buffer]]
  - [[#garbage-collection][Garbage Collection]]
  - [[#define-constants][Define Constants]]
  - [[#os-specific-adaptions][OS-specific Adaptions]]
    - [[#linux][Linux]]
    - [[#mac][Mac]]
  - [[#load-path][Load Path]]
  - [[#custom-file][Custom File]]
  - [[#backup-directory][Backup Directory]]
- [[#package-management][Package Management]]
  - [[#package-archives--initialize-package-manager][Package Archives & Initialize Package Manager]]
  - [[#use-package][use-package]]
- [[#general-configurations][General Configurations]]
  - [[#user-information][User Information]]
  - [[#quality-of-life][Quality of Life]]
    - [[#miscellaneous-options][Miscellaneous Options]]
    - [[#completions][Completions]]
    - [[#history][History]]
    - [[#environment-variables][Environment Variables]]
    - [[#sudo-edit][Sudo Edit]]
  - [[#embark][Embark]]
  - [[#dotfiles-management][Dotfiles Management]]
  - [[#file-explorer][File Explorer]]
  - [[#terminal-emulation][Terminal Emulation]]
  - [[#popup-buffers][Popup Buffers]]
- [[#appearance][Appearance]]
  - [[#general-appearance-settings][General Appearance Settings]]
  - [[#font--icons][Font & Icons]]
  - [[#themes][Themes]]
- [[#text--languages][Text & Languages]]
  - [[#wrap-text][Wrap Text]]
  - [[#spell-checking][Spell Checking]]
  - [[#undo-functionality][Undo Functionality]]
  - [[#tabs][Tabs]]
- [[#keybindings][Keybindings]]
  - [[#general][General]]
  - [[#vi-emulation][Vi Emulation]]
  - [[#hydra][Hydra]]
    - [[#basic-configuration][Basic Configuration]]
    - [[#choose-theme][Choose Theme]]
    - [[#resize-window][Resize Window]]
    - [[#eglot-commands][Eglot Commands]]
- [[#help-functionality][Help Functionality]]
  - [[#helpful][Helpful]]
  - [[#which-key][Which Key]]
- [[#programming][Programming]]
  - [[#general-programming-functionalities][General Programming Functionalities]]
    - [[#eglot][Eglot]]
    - [[#treesitter][Treesitter]]
    - [[#completions-1][Completions]]
    - [[#comments][Comments]]
    - [[#match-delimiters][Match Delimiters]]
    - [[#git-interface][Git Interface]]
  - [[#programming-languages-support][Programming Languages Support]]
    - [[#java][Java]]
    - [[#common-file-types][Common File Types]]
- [[#productivity][Productivity]]
  - [[#org-mode][Org Mode]]
    - [[#basic-configuration-1][Basic Configuration]]
    - [[#org-agenda][Org Agenda]]
      - [[#basic-configuration-2][Basic Configuration]]
      - [[#org-super-agenda][Org Super Agenda]]
    - [[#org-capture][Org Capture]]
    - [[#org-contacts][Org Contacts]]
    - [[#org-babel][Org Babel]]
  - [[#mail][Mail]]
  - [[#calendar][Calendar]]
  - [[#latex][LaTeX]]
  - [[#pdf-tools][PDF Tools]]
- [[#diminish][Diminish]]
- [[#success-notification][Success Notification]]
- [[#tangle--reload-on-save][Tangle & Reload On Save]]

* Preamble

Welcome to my Emacs configuration. This is a literate configuration, meaning code and prose are intertwined in order to provide clear documentation. [[https://orgmode.org/worg/org-contrib/babel/][Org Babel]] makes this possible in =.org= files, like this one.

Inspirations:
- [[https://github.com/MatthewZMD/.emacs.d][Matthew Zeng's Emacs setup]]
- [[https://codeberg.org/ashton314/emacs-bedrock][emacs-bedrock]]
- [[https://github.com/daviwil/emacs-from-scratch][Emacs From Scratch]]

* Startup
** Early Init
*** Defer Garbage Collection

Increase garbage collection memory threshold as early as possible to speed up startup.

#+begin_src emacs-lisp :tangle ./early-init.el

(setq gc-cons-threshold 100000000)

#+end_src

*** Disable =package-enable-at-startup=

Package initialize occurs automatically, before =user-init-file= is loaded, but after =early-init-file=. We handle package initialization, so we must prevent Emacs from doing it early.

#+begin_src emacs-lisp :tangle ./early-init.el

(setq package-enable-at-startup nil)

#+end_src

*** Unset =file-name-handler-alist=

Every file opened and loaded by Emacs will run through this list to check for a proper handler for the file, but during startup, it won’t need any of them.

#+begin_src emacs-lisp :tangle ./early-init.el

(defvar file-name-handler-alist-original file-name-handler-alist)
(setq file-name-handler-alist nil)

;; Restore original file-name-handler-alist after initialization
(add-hook 'after-init-hook
          (lambda ()
            (setq file-name-handler-alist file-name-handler-alist-original)))

#+end_src

*** Hide UI Elements

Disable them here before they've been initialized.

#+begin_src emacs-lisp :tangle ./early-init.el

(setq initial-scratch-message nil)
(menu-bar-mode -1)
(scroll-bar-mode -1)
(tool-bar-mode -1)
(blink-cursor-mode -1)

#+end_src

*** Suppress Warnings Buffer

The =*Warnings*= buffer sometimes pops up unnecessarily and intrusively, so I increase the severity level for warnings to errors.

#+begin_src emacs-lisp :tangle ./early-init.el

(setq warning-minimum-level :error)
(setq byte-compile-warnings '(not obsolete))
(setq warning-suppress-log-types '((comp) (bytecomp)))
(setq native-comp-async-report-warnings-errors 'silent)

#+end_src

** Garbage Collection

A large =gc-cons-threshold= may cause freezing and stuttering during long-term interactive use.

If you experience freezing, decrease this amount, if you experience stuttering, increase this amount.

#+begin_src emacs-lisp

(defvar better-gc-cons-threshold 4294967269 ; 512mb
  "The default value to use for `gc-cons-threshold'.

  If you experience freezing, decrease this.  If you experience stuttering, increase this.")

(add-hook 'emacs-startup-hook
          (lambda () (setq gc-cons-threshold better-gc-cons-threshold)))

#+end_src

Garbage Collect when Emacs is out of focus and avoid garbage collection when using minibuffer.

#+begin_src emacs-lisp

(add-hook 'emacs-startup-hook
          (lambda ()
            (if (boundp 'after-focus-change-function)
                (add-function :after after-focus-change-function
                              (lambda ()
                                (unless (frame-focus-state)
                                  (garbage-collect))))
              (add-hook 'after-focus-change-function 'garbage-collect))
            (defun gc-minibuffer-setup-hook ()
              (setq gc-cons-threshold (* better-gc-cons-threshold 2)))

            (defun gc-minibuffer-exit-hook ()
              (garbage-collect)
              (setq gc-cons-threshold better-gc-cons-threshold))

            (add-hook 'minibuffer-setup-hook #'gc-minibuffer-setup-hook)
            (add-hook 'minibuffer-exit-hook #'gc-minibuffer-exit-hook)))

#+end_src

** Define Constants

These constants are used below for OS-specific settings.

#+begin_src emacs-lisp

(defconst *sys/linux*
  (eq system-type 'gnu/linux)
  "Are we running on a GNU/Linux system?")

(defconst *sys/mac*
  (eq system-type 'darwin)
  "Are we running on a Mac system?")

#+end_src

** OS-specific Adaptions
*** Linux

Set super key to meta on Linux.

#+begin_src emacs-lisp

(when *sys/linux*
  (setq x-super-keysym 'meta)
  (add-to-list 'default-frame-alist '(undecorated . t)))

#+end_src

*** Mac

Set meta key, turn off option key as modifier, set dired to not use ~--dired~ flag with ~ls~ on macOS.

#+begin_src emacs-lisp

(when *sys/mac*
  (setq mac-command-modifier 'meta)
  (setq mac-option-modifier 'none)
  (setq frame-resize-pixelwise t)
  ;; (add-to-list 'default-frame-alist '(undecorated . t))
  (global-set-key (kbd "C-x C-z") 'ns-do-hide-emacs)
  ;; Start server if it isn't running
  (load "server")
  (unless (server-running-p)
    (server-start)))

#+end_src

** Load Path

Set load path to include =./elisp= folder.

#+begin_src emacs-lisp

(defun update-to-load-path (folder)
  "Update FOLDER and its subdirectories to `load-path'."
  (let ((base folder))
    (unless (member base load-path)
      (add-to-list 'load-path base))
    (dolist (f (directory-files base))
      (let ((name (concat base "/" f)))
        (when (and (file-directory-p name)
                   (not (equal f ".."))
                   (not (equal f ".")))
          (unless (member base load-path)
            (add-to-list 'load-path name)))))))

(update-to-load-path (expand-file-name "elisp" user-emacs-directory))

#+end_src

** Custom File

Customize-based settings should live in =custom.el= file.

#+begin_src emacs-lisp

(setq custom-file "~/.emacs.d/custom.el")
(load custom-file 'noerror)

#+end_src

** Backup Directory

Set backup directory location.

#+begin_src emacs-lisp

(setq backup-directory-alist
      `((".*" . ,temporary-file-directory)))
(setq auto-save-file-name-transforms
      `((".*" ,temporary-file-directory t)))

#+end_src

* Package Management
** Package Archives & Initialize Package Manager

Set package archives and initialize the package manager.

#+begin_src emacs-lisp

(setq package-archives
      '(("melpa" . "https://melpa.org/packages/")
        ("elpa" . "https://elpa.gnu.org/packages/")
        ("nongnu" . "https://elpa.nongnu.org/nongnu/")
        ("melpa-stable" . "https://stable.melpa.org/packages/")
        ("gnu-devel" . "https://elpa.gnu.org/devel/")
        ("nongnu-devel" . "https://elpa.nongnu.org/nongnu-devel/")))

(package-initialize)

#+end_src

** use-package

A nicer way to set up packages is with [[https://github.com/jwiegley/use-package][use-package]]. Make sure =use-package= is installed, refresh package contents, always ensure packages are installed and turn on verbose logging.

#+begin_src emacs-lisp

;; Ensure use-package is installed
(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))

(require 'use-package)
(setq
 use-package-always-ensure t
 use-package-verbose t)

#+end_src

* General Configurations
** User Information

Set name and email address.

#+begin_src emacs-lisp

(setq user-full-name "Martin Lönn Andersson")
(setq user-mail-address "mlonna@pm.me")

#+end_src

** Quality of Life
*** Miscellaneous Options

A collection of settings I did not know where else to put.

#+begin_src emacs-lisp

;; Increase large file warning threshold
(setq large-file-warning-threshold 100000000)

;; Set language environment
(set-language-environment "UTF-8")

;; Clean up unneccesary whitespace on save
(add-hook 'before-save-hook 'whitespace-cleanup)

;; Map yes and no to y and n
(fset 'yes-or-no-p 'y-or-n-p)

;; Disable visual and audible bell
(setq ring-bell-function 'ignore)

;; Suppress auto revert messages
(setq auto-revert-verbose nil)

;; Automatically kill all active processes when closing Emacs
(setq confirm-kill-processes nil)

;; Add a newline automatically at the end of the file upon save
(setq require-final-newline t)

;; Set default browser
(setq browse-url-browser-function 'browse-url-generic
      browse-url-generic-program "qutebrowser")

;; Make switching buffers more consistent
(setopt switch-to-buffer-obey-display-actions t)

;; Smooth scrolling
(setq scroll-step 1
      scroll-margin 1
      scroll-conservatively 101
      scroll-up-aggressively 0.01
      scroll-down-aggressively 0.01
      auto-window-vscroll nil
      fast-but-imprecise-scrolling nil
      mouse-wheel-scroll-amount '(1 ((shift) . 1))
      mouse-wheel-progressive-speed nil
      hscroll-step 1
      hscroll-margin 1)

;; Don't open a new window for ediff
(setq ediff-window-setup-function 'ediff-setup-windows-plain)

;; Automatically switch focus to new window when it is created
(defun split-and-follow-horizontally ()
  (interactive)
  (split-window-below)
  (balance-windows)
  (other-window 1))
(global-set-key (kbd "C-x 2") 'split-and-follow-horizontally)

(defun split-and-follow-vertically ()
  (interactive)
  (split-window-right)
  (balance-windows)
  (other-window 1))
(global-set-key (kbd "C-x 3") 'split-and-follow-vertically)

#+end_src

*** Completions

[[https://github.com/minad/vertico][Vertico]] provides a performant and minimalistic vertical completion UI.

[[https://github.com/minad/consult][Consult]] provides search and navigation commands based on the Emacs
completion function completing-read.

#+begin_src emacs-lisp

(use-package vertico
  :init
  (vertico-mode))

(use-package consult
  :config
  (global-set-key [remap switch-to-buffer] 'consult-buffer)
  (global-set-key [remap switch-to-buffer-other-window] 'consult-buffer-other-window)
  (global-set-key [remap switch-to-buffer-other-frame] 'consult-buffer-other-frame)
  (global-set-key [remap goto-line] 'consult-goto-line))

;; Better completion style
(use-package orderless
  :config
  (setq completion-styles '(orderless)))

;; Annotations for the minibuffer
(use-package marginalia
  :config
  (marginalia-mode 1))

#+end_src

*** History

#+begin_src emacs-lisp

;; Save text entered in minibuffer prompts
(setq history-length 25)
(savehist-mode 1)

;; Remember recently edited files
(recentf-mode 1)

;; Automatically reread files when changed
(setopt auto-revert-avoid-polling t)
(setopt auto-revert-interval 5)
(setopt auto-revert-check-vc-info t)
(global-auto-revert-mode t)

;; Auto reload non-file buffers
(setq global-auto-revert-non-file-buffers t)

#+end_src

*** Environment Variables

Get environment variables from your shell with [[https://github.com/purcell/exec-path-from-shell][exec-path-from-shell]].

#+begin_src emacs-lisp

(use-package exec-path-from-shell
  :config
  ;; Don't start an interactive shell (improves startup time)
  (setq exec-path-from-shell-arguments nil)
  ;; Which environment variables to import
  (dolist (var '("LANG" "LC_ALL"))
    (add-to-list 'exec-path-from-shell-variables var))
  (exec-path-from-shell-initialize))

#+end_src

*** Sudo Edit

Edit files with sudo privileges with [[https://github.com/nflath/sudo-edit/tree/74eb1e6986461baed9a9269566ff838530b4379b][sudo-edit]].

#+begin_src emacs-lisp

(use-package sudo-edit
  :defer t
  :diminish
  :config
  (global-set-key (kbd "C-c C-r") 'sudo-edit))

#+end_src

** Embark

[[https://github.com/oantolin/embark/][Embark]] provides commands to run based on the current context.

#+begin_src emacs-lisp

(use-package embark
  :bind ("M-;" . embark-act))

(use-package embark-consult
  :after embark
  :hook (embark-collect-mode-hook . embark-consult-preview-minor-mode))

#+end_src

** Dotfiles Management

I manage my dotfiles with [[https://github.com/tuh8888/chezmoi.el][chezmoi]], and the [[https://github.com/tuh8888/chezmoi.el][chezmoi Emacs package]] provides some useful functions for this.

#+begin_src emacs-lisp

(use-package chezmoi
  :bind (("C-c C s" . chezmoi-write)
         ("C-c C f" . chezmoi-find))
  :config
  ;; (require 'chezmoi-cape)
  )

#+end_src

